/******************************************************************************

                  版权所有 (C), 厦门优胜卫厨科技有限公司

 ******************************************************************************
  文 件 名   : main.c
  版 本 号   : 初稿
  作    者   : LV
  生成日期   : 2018年4月12日
  最近修改   :
  功能描述   :主函数
  函数列表   :
  修改历史   :
  1.日    期   : 2018年4月12日
    作    者   : LV
    修改内容   : 创建文件

******************************************************************************/

#include "picos.h"
#include "Event_task.h"
#include "set_io.h"
#include "set_PIC.h"
#include "xc8.h"

void interrupt ISR(void);

/*****************************************************************************
 函 数 名  : main
 功能描述  : 主函数执行系统功能
 输入参数  : void  
 输出参数  : 无
 返 回 值  : 
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2018年4月12日
    作    者   : LV
    修改内容   : 新生成函数

*****************************************************************************/
void main(void)              
{         
	set_pic(); //对PIC芯片进行配置
    set_io(); //设置io口输出，关闭全部模拟口，(MICROCHIP默认开启) 
    task_start(); //进入系统时间片任务调度循环
}

/*****************************************************************************
 函 数 名  : ISR
 功能描述  : 中断函数
 输入参数  : void  
 输出参数  : 无
 返 回 值  : void
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2018年4月12日
    作    者   : LV
    修改内容   : 新生成函数

*****************************************************************************/
void interrupt ISR(void)
{    
    if(TMR0IE && TMR0IF)
    {       
#if(FOSC_CPU == 32)
        NOP(); NOP();
        TMR0L += 6 + (1); //偏置值+本条语句的执行的耗费时间//125us
#elif(FOSC_CPU == 16)
        TMR0L += 6 + ((2*8) / FOSC_CPU);//偏置值+本条语句的执行的耗费时间//125us
#elif(FOSC_CPU == 8)
		TMR0L += 3 + 130; //偏置值+本条语句的执行的耗费时间//125us
#endif
        TMR0IF = 0;

        /*在此加入TIMR0中断服务*/    
        os_time_tick();                  //调度系统时钟处理函数        
    }
}
