/******************************************************************************

                  版权所有 (C), 厦门优胜卫厨科技有限公司

 ******************************************************************************
  文 件 名   : Picos.c
  版 本 号   : 初稿
  作    者   : LV
  生成日期   : 2018年4月12日
  最近修改   :
  功能描述   :任务调度程序
  函数列表   :
  修改历史   :
  1.日    期   : 2018年4月12日
    作    者   : LV
    修改内容   : 创建文件

******************************************************************************/

#include "Event_task.h"
#include "Picos.h"
#include "xc8.h"
#include "set_io.h"
#include "set_PIC.h"


/*  系统变量声明*/
static uint16 s_system_tick = 0; //定义系统时钟基准计时器
static uint16 s_timeslice[OS_MAX_TASKS] = {0};   //定义程序时间片初始值
static uint16 s_run_time[OS_MAX_TASKS] = {0};  //定义一个记录任务运行时间的数组
static uint8 s_secondcount = 0;
static uint32 s_IdleTimes = 0;
uint8 cnt;
uint8 fosc_x_8m;


/* 任务栈初始化，定义每个任务和其时间片周期。*/
static const _task_ task[OS_MAX_TASKS] = {TaskA,10MS};//{任务函数，时间}


/*****************************************************************************
 函 数 名  : task_start
 功能描述  : 此函数开始，根据时间片设定循环调用各个任务
 输入参数  : void  
 输出参数  : 无
 返 回 值  : 
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2018年4月12日
    作    者   : LV
    修改内容   : 新生成函数

*****************************************************************************/
void task_start(void)
{    
    s_system_tick = 0; //系统时钟计时器
    do
    {
        for(cnt = 0;cnt < OS_MAX_TASKS;cnt++) //查询是否有任务需要执行
        {
            if((s_system_tick - s_timeslice[cnt]) >= (task[cnt].TaskPeriod)) //查询任务周期是否到达
            {
                s_run_time[cnt] = 0; //运行时间归零
                s_timeslice[cnt] = s_system_tick;//时间片重新赋值
                task[cnt].TaskProc(); //调用任务      
                s_run_time[cnt] = s_system_tick-s_timeslice[cnt]; //计算当前任务运行的时间
            }
        }
    }while(1);
}

/*****************************************************************************
 函 数 名  : os_task_run_time_get
 功能描述  : 获得第n个系统任务时间的持续运行时间，以系统时间为基准
 输入参数  : uint8 task_n  
 输出参数  :任务执行时间
 返 回 值  : 
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2018年4月12日
    作    者   : LV
    修改内容   : 新生成函数

*****************************************************************************/
uint16 os_task_run_time_get(uint8 task_n)
{
    return s_run_time[task_n];
}

/*****************************************************************************
 函 数 名  : time_clock_second_tick_add
 功能描述  : 时钟秒的驱动，一秒执行一次
 输入参数  : void  
 输出参数  : 无
 返 回 值  : 
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2018年4月12日
    作    者   : LV
    修改内容   : 新生成函数

*****************************************************************************/
void time_clock_second_tick_add(void)
{
    s_secondcount++;
}

/*****************************************************************************
 函 数 名  : os_time_tick
 功能描述  : 此系统时钟函数，用于对各个任务时间片计时处理，定时中断调用，此
             函数为所有任务的时间基准，调用时间与系统定义MS 需要对应一致。
 输入参数  : 无 
 输出参数  : 无
 返 回 值  : 
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2018年4月12日
    作    者   : LV
    修改内容   : 新生成函数

*****************************************************************************/
void os_time_tick(void)
{   
    s_system_tick++; //系统基准累加计数
#if    OSTickHOOK_EN > 0
    os_tick_hook(); //此处可定义系统钩子函数，钩子函数不受限于任务调度函数OSStart，运行周期=时间基准
	static uint16 s_time_tick = 0;
	if(++s_time_tick >= 8*1000) //一秒归零
	{
		s_time_tick = 0;
		time_clock_second_tick_add();
	}
#endif    
}

#if    OSTickHOOK_EN > 0
/*****************************************************************************
 函 数 名  : os_tick_hook
 功能描述  : 系统时钟钩子函数
 输入参数  : 无 
 输出参数  : 无
 返 回 值  : 
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2018年4月12日
    作    者   : LV
    修改内容   : 新生成函数

*****************************************************************************/
void os_tick_hook(void)
{    //在此加入系统时钟钩子函数
}
#endif

#if OSIdle_EN > 0
/*****************************************************************************
 函 数 名  : os_idle
 功能描述  : 空闲任务
 输入参数  : 无  
 输出参数  : 无
 返 回 值  : 
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2018年4月12日
    作    者   : LV
    修改内容   : 新生成函数

*****************************************************************************/
void os_idle(void)
{
    s_IdleTimes++;
    NOP(); NOP(); NOP(); NOP(); NOP();    NOP(); NOP(); NOP();
}
#endif 


/*****************************************************************************
 函 数 名  : nop_200
 功能描述  : 延时200个指令周期，在8m晶振下相当于延时100us
 输入参数  : 无  
 输出参数  : 无
 返 回 值  : 
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2018年4月12日
    作    者   : LV
    修改内容   : 新生成函数

*****************************************************************************/
void nop_200(void)
{
		/*200个指令周期延时，已经扣除本函数的进入和退出时所需的6个指令周期*/
        NOP(); NOP(); NOP(); NOP();
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();
        
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();
        
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();
        
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();
        
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();
        
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();
        
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();
       
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();
       
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();
       
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();
        NOP(); NOP(); NOP(); NOP(); NOP();   NOP(); NOP(); NOP(); NOP(); NOP();

    }

/*****************************************************************************
 函 数 名  : delay_100us
 功能描述  : 调用NOP延时100us
 输入参数  : uint8 n  
 输出参数  : 无
 返 回 值  : 
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2018年4月12日
    作    者   : LV
    修改内容   : 新生成函数

*****************************************************************************/
void delay_100us(uint8 n)
{   
    while(n--)
    {
        fosc_x_8m = FOSC_CPU/8; //几倍于8m晶振
        while(fosc_x_8m)
        {
            fosc_x_8m--;
            nop_200(); //8m晶振下100us的NOP数量
        }
    }
}


/*****************************************************************************
 函 数 名  : delay_1ms
 功能描述  : 调用NOP延时1ms
 输入参数  : uint16 n  
 输出参数  : 无
 返 回 值  : 
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2018年4月12日
    作    者   : LV
    修改内容   : 新生成函数

*****************************************************************************/
void delay_1ms(uint16 n)
{
    while(n--)
    {
        delay_100us(10);
    }
    
}
    

