/******************************************************************************

                  版权所有 (C), 厦门优胜卫厨科技有限公司

 ******************************************************************************
  文 件 名   : Set_io.c
  版 本 号   : 初稿
  作    者   : LV
  生成日期   : 2018年4月12日
  最近修改   :
  功能描述   :io口 的初始化配置
  函数列表   :
  修改历史   :
  1.日    期   : 2018年4月12日
    作    者   : LV
    修改内容   : 创建文件

******************************************************************************/

#include "Picos.h"
#include "Event_task.h"
#include "set_PIC.h"
#include "xc8.h"

/*****************************************************************************
 函 数 名  : set_io
 功能描述  : 设置所以io口为数字输出0
 输入参数  : 无
 输出参数  : 无
 返 回 值  : 
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2018年4月12日
    作    者   : LV
    修改内容   : 新生成函数

*****************************************************************************/
void  set_io( void )
{
    /* 关闭全部模拟口，(MICROCHIP默认开启) */
    ADCON0 = 0X00;
    ANCON0 = 0;
    ANCON1 = 0;
    ANCON2 = 0;

	/* 关闭全部CCP功能口*/
    CCP1CON = 0X00;    //管脚初始化IO全部输出

	/* 关闭外部存储总线*/
    MEMCON |= 0X80;
    TRISA = 0;
    TRISB = 0;
    TRISC = 0;
    TRISD = 0;
    TRISE = 0;
    TRISF = 0;
    TRISG = 0;
    TRISH = 0;
    TRISJ = 0;

    PORTA = 0;
    PORTB = 0;
    PORTC = 0;
    PORTD = 0;
    PORTE = 0;
    PORTF = 0;
    PORTG = 0;
    PORTH = 0;
    PORTJ = 0;   
}

/*****************************************************************************
 函 数 名  : Inverse_IO
 功能描述  : IO按位取反
 输入参数  : void  
 输出参数  : 无
 返 回 值  : 
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2018年4月13日
    作    者   : LV
    修改内容   : 新生成函数

*****************************************************************************/
void Inverse_IO(void)
{
    PORTA = ~PORTA;
    PORTB = ~PORTB;
    PORTC = ~PORTC;
    PORTD = ~PORTD;
    PORTE = ~PORTE;
    PORTF = ~PORTF;
    PORTG = ~PORTG;
    PORTH = ~PORTH;
    PORTJ = ~PORTJ;
}

