/******************************************************************************

                  版权所有 (C), 厦门优胜卫厨科技有限公司

 ******************************************************************************
  文 件 名   : set_PIC.c
  版 本 号   : 初稿
  作    者   : LV
  生成日期   : 2018年4月12日
  最近修改   :
  功能描述   :PIC芯片的相关配置
  函数列表   :
  修改历史   :
  1.日    期   : 2018年4月12日
    作    者   : LV
    修改内容   : 创建文件

******************************************************************************/

#include "Event_task.h"
#include "picos.h"
#include "xc8.h"
#include "Set_io.h"


/*****************************************************************************
 函 数 名  : set_pic
 功能描述  : 对PIC进行配置
 输入参数  : void  
 输出参数  : 无
 返 回 值  : 
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2018年4月12日
    作    者   : LV
    修改内容   : 新生成函数

*****************************************************************************/
void set_pic(void)
{
    /*  振荡器配置*/
    OSCCON = 0B01110000;                  //选用内部晶振 ，振荡频率为16M
    T0CON = (0B11000000) | 0X00;           //CONGIG TIME0 AND START IT  ,8位定时器，timer预分频2.(FOSC_CPU=16)
    OSCTUNE = 0X00;

	/* TMR0系统时钟初始化,采用定时零中断。中断频率为125 us。定时数= 125/(4/FOSC) */
    INTCON |= 0B11110000;          //ENABLE TIME0 INT 
}
